In [1]:
import sqlite3 as sq3
import pandas as pd

In [2]:
path = "employee.db"

In [3]:
con = sq3.Connection(path)

In [4]:
cur = con.cursor()

In [5]:
# cur.execute("""CREATE TABLE city (
#     id INTEGER PRIMARY KEY AUTOINCREMENT,
#     city_name CHAR(128) NOT NULL,
#     lat DECIMAL(9,6) NOT NULL,
#     long DECIMAL(9,6) NOT NULL,
#     country_id INT NOT NULL
# );""")

In [6]:
# cur.execute("""CREATE TABLE country (
#     id INTEGER PRIMARY KEY AUTOINCREMENT,
#     country_name char(128) NOT NULL,
#     country_name_eng char(128) NOT NULL,
#     country_code char(8) NOT NULL,
#     CONSTRAINT country_ak_1 UNIQUE (country_name),
#     CONSTRAINT country_ak_2 UNIQUE (country_name_eng),
#     CONSTRAINT country_ak_3 UNIQUE (country_code)
# );""")

In [7]:
cur.execute("""INSERT INTO city (id,city_name, lat, long, country_id) VALUES (1,'Berlin', 52.520008, 13.404954, 1);""")

In [8]:
# cur.execute("DROP TABLE city;")
# cur.execute("DROP TABLE country;")

In [9]:
cur.execute("""INSERT INTO city (city_name, lat, long, country_id) VALUES ('Belgrade', 44.787197, 20.457273, 2);""")

In [10]:
cur.execute("""INSERT INTO city (city_name, lat, long, country_id) VALUES ('Zagreb', 45.815399, 15.966568, 3);
 """)

In [11]:
cur.execute("INSERT INTO city (city_name, lat, long, country_id) VALUES ('New York', 40.73061, -73.935242, 4);")

In [12]:
cur.execute("INSERT INTO city (city_name, lat, long, country_id) VALUES ('Los Angeles', 34.052235, -118.243683, 4);")

In [13]:
cur.execute("INSERT INTO city (city_name, lat, long, country_id) VALUES ('Warsaw', 52.237049, 21.017532, 5);")

In [14]:
res = cur.execute("SELECT * FROM city")
res.fetchall()

[(1, 'Berlin', 52.520008, 13.404954, 1),
 (2, 'Belgrade', 44.787197, 20.457273, 2),
 (3, 'Zagreb', 45.815399, 15.966568, 3),
 (4, 'New York', 40.73061, -73.935242, 4),
 (5, 'Los Angeles', 34.052235, -118.243683, 4),
 (6, 'Warsaw', 52.237049, 21.017532, 5)]

In [15]:
cur.execute("INSERT INTO country (country_name, country_name_eng, country_code) VALUES ('Deutschland', 'Germany', 'DEU');")
cur.execute("INSERT INTO country (country_name, country_name_eng, country_code) VALUES ('Srbija', 'Serbia', 'SRB');")
cur.execute("INSERT INTO country (country_name, country_name_eng, country_code) VALUES ('Hrvatska', 'Croatia', 'HRV');")
cur.execute("INSERT INTO country (country_name, country_name_eng, country_code) VALUES ('United Stated of America', 'United Stated of America', 'USA');")
cur.execute("INSERT INTO country (country_name, country_name_eng, country_code) VALUES ('Polska', 'Poland', 'POL');")

In [16]:
res_c = cur.execute("SELECT * FROM country")
res_c.fetchall()

[(1, 'Deutschland', 'Germany', 'DEU'),
 (2, 'Srbija', 'Serbia', 'SRB'),
 (3, 'Hrvatska', 'Croatia', 'HRV'),
 (4, 'United Stated of America', 'United Stated of America', 'USA'),
 (5, 'Polska', 'Poland', 'POL')]

In [17]:
query = """SELECT * FROM city"""
observations = pd.read_sql(query, con)
observations.head(5)

   id    city_name        lat        long  country_id
0   1       Berlin  52.520008   13.404954           1
1   2     Belgrade  44.787197   20.457273           2
2   3       Zagreb  45.815399   15.966568           3
3   4     New York  40.730610  -73.935242           4
4   5  Los Angeles  34.052235 -118.243683           4

In [18]:
!wget -P data https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-ML0232EN-SkillsNetwork/asset/classic_rock.db

--2023-12-23 00:15:05--  https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-ML0232EN-SkillsNetwork/asset/classic_rock.db
Resolving cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud (cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud)... 198.23.119.245
Connecting to cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud (cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud)|198.23.119.245|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 5652480 (5.4M) [binary/octet-stream]
Saving to: 'data/classic_rock.db'

classic_rock.db     100%[===================>]   5.39M   498KB/s    in 11s

2023-12-23 00:15:16 (503 KB/s) - 'data/classic_rock.db' saved [5652480/5652480]

In [38]:
path1 = 'data/classic_rock.db'
cn = sq3.Connection(path1)
q = """SELECT * FROM rock_songs"""
q1 = """SHOW DATABASES"""

In [39]:
obs = pd.read_sql(q1, con)
obs.head()

DatabaseError: Execution failed on sql 'SHOW DATABASES': near "SHOW": syntax error